











### Pandas
1. Pandas is a Python library used for working with data sets.  
2. It has functions for analyzing, cleaning, exploring, and manipulating data.   
3. The name "Pandas" has a reference to "Python Data   Analysis"


### Main Purpose(USE) of using Pandas Library:

1. Pandas allows us to analyze data and make conclusions based on statistical theories observed in from data.  
2. Pandas can clean messy data sets, and make them readable and relevant for future use.  
3. Relevant data is very important in data science.

In [245]:
import pandas as pd

In [ ]:
pd?

In [ ]:
pd.__version__

In [ ]:
!pip show pandas

### Series
A Series in Datastructure of Pandas which is like a column in a table.It is a one-dimensional array holding data of any type.

In [ ]:
s = ["A","B","C","D"]
type(s)
print(s)

In [ ]:
s = pd.Series(['A','B','C','D'])
s

In [ ]:
s[::-1]

In [ ]:
type(s)

In [ ]:
len(s)

### Labels
If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.This labels can be used to access a specified value.With the index argument, you can name your own labels.

In [ ]:
s = pd.Series(['A','B','C','D'],index=['E101','E102','E103','E104'])

In [ ]:
s

In [ ]:
print(s['E101'])
print()

print(s['E102':'E104'])
print(s[0:3])

#s['E106']="F"
#print(s)
print()
#s['E104']='d'
#print(s)

In [ ]:
# Creating series from array
import numpy as np
data = np.array(['a','b','c','d',1,5])
print(data)
s = pd.Series(data)
print(s)
print(s[0::2])

In [ ]:
x = list(range(101,106))

In [ ]:
data=np.array(["India","UK","USA","Japan","SriLanka"])
s=pd.Series(data,index=list(range(101,106)))
print(s)
print(s[103])
s[104]=100
s[102]=120
print(s)

In [ ]:
country = ["India","UK","USA","Japan","SriLanka"]
sales = [10000,4300,2000,80000,2000]

In [ ]:
S1 = pd.Series(sales,index=country)
S1
S1["India":"Japan"]

In [ ]:
print(S1['UK'])

S1['India']=50000
print(S1)

S1["Israel"]=1000
print(S1)

In [ ]:
S1[3]

### Creating a Series from dict
A dict can be passed as input and if no index is specified, then the dictionary keys are taken in a sorted order to construct index. If index is passed, the values in data corresponding to the labels in the index will be pulled out.

In [ ]:
data={'a':0,'b':2,'c':3.2}
s1=pd.Series(data)
print(s1)

In [ ]:
print(s1['b'])
print(s1[1])
print()
print(s1[:-1])
s1[1]=10
print(s1)

In [ ]:
data = {'a' : 0., 'b' : 1., 'e' : 2.}
s = pd.Series(data,index=['x','t','e','f','a','y'])
print(s)

### Creating a Series from Scalar
If data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [ ]:
data = pd.Series(7,index=["A","B","C","D","E"])
print(data)
type(data)

### DataFrames
Data sets in Pandas are usually two-dimensional tables, called DataFrames.It is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.Series is just a column but DataFrame is a whole table.

In [8]:
Customers = {
    'Id':[101,102,103],
    'Name':['Roy','Clara','Ross'],
    'Location':['Goa','Bangalore','Pune']

}

print(Customers)

{'Id': [101, 102, 103], 'Name': ['Roy', 'Clara', 'Ross'], 'Location': ['Goa', 'Bangalore', 'Pune']}

In [9]:
cust_data = pd.DataFrame(Customers)

In [10]:
cust_data

    Id   Name   Location
0  101    Roy        Goa
1  102  Clara  Bangalore
2  103   Ross       Pune

In [11]:
cust_data1 = pd.DataFrame(Customers,index=['a','b','c'])
cust_data1

    Id   Name   Location
a  101    Roy        Goa
b  102  Clara  Bangalore
c  103   Ross       Pune

In [12]:
my_dict = {'Name':"Nimisha",'Age':23,'City':"Mumbai"}

In [16]:
table1 = pd.DataFrame(my_dict,index=["A"])

In [17]:
table1

      Name  Age    City
A  Nimisha   23  Mumbai

In [20]:
my_dict = {'Name':["Nimisha"],'Age':[23],'City':["Mumbai"]}

In [21]:
table2 = pd.DataFrame(my_dict)
table2

      Name  Age    City
0  Nimisha   23  Mumbai

### Creating an empty dataframe

In [22]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [26]:
Column_data = ['Stu Id','Student','Subject','Marks']

In [38]:
df = pd.DataFrame(columns=Column_data)
df

Empty DataFrame
Columns: [Stu Id, Student, Subject, Marks]
Index: []

In [39]:
import warnings 
warnings.filterwarnings("ignore")

In [40]:
df=df.append({'Stu Id':1,'Student':'Sam',"Subject":'Science','Marks':50},ignore_index=True)
df

  Stu Id Student  Subject Marks
0      1     Sam  Science    50

In [50]:
stud_df = pd.DataFrame(columns=Column_data)
stud_df

Empty DataFrame
Columns: [Stu Id, Student, Subject, Marks]
Index: []

In [51]:
stud_df["Stu Id"]

Series([], Name: Stu Id, dtype: object)

In [49]:
stud_df["Id"]=4
stud_df

  Stu Id Student Subject Marks  Id
0    NaN     NaN     NaN   NaN   4
1    NaN     NaN     NaN   NaN   4

In [52]:
stud_df['Stu Id']=[2,3,4]
stud_df['Student']=['Nishita','Chinmay','Gaurav']
stud_df['Subject']=['Maths','Economics','History']
stud_df['Marks']=[34,67,70]
stud_df

   Stu Id  Student    Subject  Marks
0       2  Nishita      Maths     34
1       3  Chinmay  Economics     67
2       4   Gaurav    History     70

In [56]:
stud_df[["Subject","Marks"]]

     Subject  Marks
0      Maths     34
1  Economics     67
2    History     70

In [63]:

data=[['Amit',35,"Mumbai"],['Riya',24,"Pune"],['Clara',40,"Bangalore"],["Rahul",26,"Pune"]]
print(data)
df=pd.DataFrame(data,columns=["Name","Age","City"])
df

[['Amit', 35, 'Mumbai'], ['Riya', 24, 'Pune'], ['Clara', 40, 'Bangalore'], ['Rahul', 26, 'Pune']]

    Name  Age       City
0   Amit   35     Mumbai
1   Riya   24       Pune
2  Clara   40  Bangalore
3  Rahul   26       Pune

In [71]:
df.columns=["First Name","Age","Location"]  # renaming the column names
df

  First Name  Age   Location
0       Amit   35     Mumbai
1       Riya   24       Pune
2      Clara   40  Bangalore
3      Rahul   26       Pune

In [72]:
data={'Name':['Amit','Nimisha','Priya'],'Age':[20,24,21]}
df=pd.DataFrame(data)

df=pd.DataFrame(data,index=['rank1','rank2','rank3'])
df

          Name  Age
rank1     Amit   20
rank2  Nimisha   24
rank3    Priya   21

In [73]:
data={'Name':['Amit','Nimisha','Priya'],'Age':[20,24,21],
      "City name":["Delhi","Bangalore","Pune"],"Marks":[45,34,20]}
data

{'Name': ['Amit', 'Nimisha', 'Priya'],
 'Age': [20, 24, 21],
 'City name': ['Delhi', 'Bangalore', 'Pune'],
 'Marks': [45, 34, 20]}

In [74]:
stu_dataset = pd.DataFrame(data,index=["001","002","003"])
stu_dataset

        Name  Age  City name  Marks
001     Amit   20      Delhi     45
002  Nimisha   24  Bangalore     34
003    Priya   21       Pune     20

In [76]:
stu_dataset[["City name","Name","Marks"]]

     City name     Name  Marks
001      Delhi     Amit     45
002  Bangalore  Nimisha     34
003       Pune    Priya     20

In [78]:
#rowlabels will be added on the top of the index numbers
df1=pd.DataFrame(data,index=list(range(101,104)))
#row indexes will replace the original index numbers
df1

        Name  Age  City name  Marks
101     Amit   20      Delhi     45
102  Nimisha   24  Bangalore     34
103    Priya   21       Pune     20

In [97]:
df1["City name"]

101        Delhi
102    Bangalore
103         Pune
Name: City name, dtype: object

In [117]:
#df.loc[inclusive:inclusive]-->labels
#df.iloc[inclusive:exclusive]-->indexes

#loc - loaction specific(labels)
df1.loc[[101,103],["City name","Age"]] # For particular values
#df1.loc[101:103,"Name":"City name"] # Range of values

    City name  Age
101     Delhi   20
103      Pune   21

In [118]:
stu_dataset

        Name  Age  City name  Marks
001     Amit   20      Delhi     45
002  Nimisha   24  Bangalore     34
003    Priya   21       Pune     20

In [131]:
#iloc- index loaction specific -- indexex
stu_dataset.iloc[0:2,::-1]  # for range of values
stu_dataset.iloc[[0,2],[0,3]]

      Name  Marks
001   Amit     45
003  Priya     20

In [132]:
df

          Name  Age
rank1     Amit   20
rank2  Nimisha   24
rank3    Priya   21

In [134]:
df

          Name  Age address
rank1     Amit   20  Mumbai
rank2  Nimisha   24    Pune
rank3    Priya   21  Mumbai

In [140]:
#adding a column
df["address"]=["Bangalore","Chennai","Hyderabad"]
df

          Name  Age    address
rank1     Amit   20  Bangalore
rank2  Nimisha   24    Chennai
rank3    Priya   21  Hyderabad

In [144]:
# will be used for renaming the columns & not for rearraqnging them.
df.columns=["Name","Age","address"]
df

          Name  Age    address
rank1     Amit   20  Bangalore
rank2  Nimisha   24    Chennai
rank3    Priya   21  Hyderabad

In [178]:
#rearranging the column order
df=df[["Name","address","Age"]]
df

          Name    address  Age
rank1     Amit  Bangalore   20
rank2  Nimisha    Chennai   24
rank3    Priya  Hyderabad   21

In [179]:
df.columns

Index(['Name', 'address', 'Age'], dtype='object')

In [184]:
df['Newcol']=[6,12,30]
print(df)

df["Revised_col"]=df["Newcol"]/2
print(df)

          Name    address  Age  Revised_col  Newcol
rank1     Amit  Bangalore   20          3.0       6
rank2  Nimisha    Chennai   24          6.0      12
rank3    Priya  Hyderabad   21         15.0      30
          Name    address  Age  Revised_col  Newcol
rank1     Amit  Bangalore   20          3.0       6
rank2  Nimisha    Chennai   24          6.0      12
rank3    Priya  Hyderabad   21         15.0      30

In [185]:
#deleting the column
del df["Newcol"]
df

          Name    address  Age  Revised_col
rank1     Amit  Bangalore   20          3.0
rank2  Nimisha    Chennai   24          6.0
rank3    Priya  Hyderabad   21         15.0

In [198]:
?df.drop

In [234]:
#ideally used for deleting the data
#df.drop("rank1",axis=0)  # temporary changes as inplace is bydefault "False"
df.drop(['Revised_col'],axis=1)
#df.drop("rank1",axis=0,inplace=True) # permanent changes as inplace is set to be "True"

          Name    address  Age
rank2  Nimisha    Chennai   24
rank3    Priya  Hyderabad   21

In [236]:
df

          Name    address  Age  Revised_col
rank2  Nimisha    Chennai   24          6.0
rank3    Priya  Hyderabad   21         15.0

In [241]:
df.drop(df[(df.Name=="Nimisha") | (df.Revised_col==10)].index,axis=0)

        Name    address  Age  Revised_col
rank3  Priya  Hyderabad   21         15.0

In [244]:
df

          Name    address  Age  Revised_col
rank2  Nimisha    Chennai   24          6.0
rank3    Priya  Hyderabad   21         15.0

In [243]:
import os
os.getcwd()

'C:\\Users\\Admin\\Desktop\\PGA24'

In [247]:
df.to_csv(r"C:\\Users\\Admin\\Documents\newfile.csv",index=True,header=True)

In [248]:
df.to_excel("Samplefile.xlsx",index=False,header=False)

In [249]:
#creating a copy of a dataframe
new_df=pd.DataFrame.copy(df)

In [250]:
new_df

          Name    address  Age  Revised_col
rank2  Nimisha    Chennai   24          6.0
rank3    Priya  Hyderabad   21         15.0

In [253]:
#reading df from a file
data = pd.read_csv(r"C:\Users\Admin\Documents\newfile.csv",index_col=0,header=0)
data

          Name    address  Age  Revised_col
rank2  Nimisha    Chennai   24          6.0
rank3    Priya  Hyderabad   21         15.0

In [257]:
?pd.read_excel

In [258]:
new_data = pd.read_excel("Samplefile.xlsx",header=None,names=["Name","City","Age","Revised_col"])
new_data

      Name       City  Age  Revised_col
0  Nimisha    Chennai   24            6
1    Priya  Hyderabad   21           15

In [259]:
data.at["rank2","Name"]="Riya"

In [274]:
data

        Name    address  Age  Revised_col
rank2   Riya    Chennai   24          6.0
rank3  Priya  Hyderabad   21         15.0

In [276]:
import numpy as np
data.loc[(data.Name=="Priya") & (data.address=="Hyderabad"),
       ["address","Age"]]=["Delhi",np.nan]
data

        Name  address   Age  Revised_col
rank2   Riya  Chennai  24.0          6.0
rank3  Priya    Delhi   NaN         15.0

In [281]:
#sorting on the basis of certain criteria

data=data.sort_values(["address"],ascending=False)
print(data)
#True, False

data=data.sort_values(["address","Name"],ascending=[True,True])
data

        Name  address   Age  Revised_col
rank3  Priya    Delhi   NaN         15.0
rank2   Riya  Chennai  24.0          6.0

        Name  address   Age  Revised_col
rank2   Riya  Chennai  24.0          6.0
rank3  Priya    Delhi   NaN         15.0

In [284]:
data.sort_index(axis=1,ascending=True)

        Age   Name  Revised_col  address
rank2  24.0   Riya          6.0  Chennai
rank3   NaN  Priya         15.0    Delhi